public class List extends Board {
    // Class Model (Pojo) - клас, який відображає сутність з якою працюємо
    // Для передачі даних в запит

    // Клас List наслідується від класу Board

    // Обов'язковий параметр запиту для створення листа
    public String idBoard;

    // гетери та сетери - щоб не порушувати принципи ООП: звертатись до змінних не напряму
    // для гетера идентифікатору дошки переприсвоюємо метод getId.
    // Так як в відповіді запиту на створення листа: id - ідентифікатор листа, idBoard - ідентифікатор дошки
    // board
    public String getId() {
        return idBoard;
    }

    // list
    public String getListId() {
        return id;
    }

}
